# Каждый из некоторого множества школьников некоторой школы знает некоторое количество языков.
# Нужно определить сколько языков знают все школьники, и сколько языков знает хотя бы один из школьников.

# В первой строке задано количество школьников. Для каждого из школьников сперва записано количество языков,
# которое он знает, а затем - названия языков, по одному в строке.

# В первой строке выведите количество языков, которые знают все школьники.
# Начиная со второй строки - список таких языков. Затем - количество языков, которые знает хотя бы один школьник,
# на следующих строках - список таких языков. Языки нужно выводить в лексикографическом порядке, по одному на строке.

X = int(input())
Y = []
for i in range(X):
    Y.append(set())
    for j in range(int(input())):
        Y[i].add(input())
R = set.intersection(*Y)
A = set.union(*Y)
print(len(R), *sorted(R), sep='\n')
print(len(A), *sorted(A), sep='\n')
